---
kind: method
id: M:Autodesk.Revit.DB.Analysis.FieldDomainPoints.Dispose
source: html/4128714b-ffca-6468-d0f3-bc69d713c37b.htm
---
# Autodesk.Revit.DB.Analysis.FieldDomainPoints.Dispose Method

Releases all resources used by the FieldDomainPoints

## Syntax (C#)
```csharp
public void Dispose()
```